chadnickbok/voicewatch/doodad-runtime/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
# CONFIG_COMPILER_CXX_RTTI is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_HZ=1000
# Personal-package app IDs, incoming digests, and generation directories exceed
# FAT 8.3 names. The longest v0 component is a 64-byte derived generation key
# plus `.installing` (75 bytes); use a heap-backed maximum-length LFN buffer on
# both board builds.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
# CONFIG_ESP_SYSTEM_MEMPROT_FEATURE is not set

CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Keep only genuinely small general-purpose allocations internal. Larger
# HTTP/UI/runtime buffers can live in PSRAM, preserving DMA-capable heap for
# Wi-Fi receive traffic and hardware drivers.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

CONFIG_WAMR_BUILD_RELEASE=y
# CONFIG_WAMR_ENABLE_AOT is not set
CONFIG_WAMR_ENABLE_INTERP=y
CONFIG_WAMR_INTERP_FAST=y
CONFIG_WAMR_INTERP_LOADER_NORMAL=y
# CONFIG_WAMR_ENABLE_LIB_PTHREAD is not set
# CONFIG_WAMR_ENABLE_LIBC_BUILTIN is not set
# CONFIG_WAMR_ENABLE_LIBC_WASI is not set
# CONFIG_WAMR_ENABLE_APP_FRAMEWORK is not set

CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_DEF_REFR_PERIOD=8
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y

# Bound Wi-Fi's internal-RAM pool for the watch's low-throughput HTTPS usage.
# Eight static RX buffers still exceeds the configured AMPDU RX window of six.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=5
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=5
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=4
CONFIG_ESP_WIFI_RX_BA_WIN=5
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8

# TLS is host-owned and both boards have ample PSRAM but little spare internal
# RAM after LVGL, WAMR, and Wi-Fi are resident.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# The ESP32-S3 AES accelerator requires internal DMA bounce buffers for TLS
# records stored in PSRAM. Software AES is fast enough for periodic weather
# fetches and avoids exhausting the small remaining internal heap.
# CONFIG_MBEDTLS_HARDWARE_AES is not set
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_BUTTON=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y

# The production artifacts both expose the same local live-agent contract.
CONFIG_DOODAD_VOICE_UPLINK=y
CONFIG_DOODAD_VOICE_AUTOCONNECT=y
